cask_args appdir: '/Applications'
tap 'homebrew/cask'
tap 'neovim/neovim'

# Tools
brew 'git'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'curl'
brew 'ack'
brew 'fzf'
brew 'dos2unix'
brew 'gettext'
brew 'bazel'
cask 'dash'
cask 'paw'
cask 'macdown'
cask 'wireshark'

# Term
cask 'iterm2'
brew 'zsh'
brew 'zsh-completions'

# Lang
cask 'java'
brew 'python'
brew 'pyenv'
brew 'clojure'
brew 'leiningen'
brew 'go'
brew 'forego'
brew 'elixir'
brew 'swi-prolog'

# Text
brew 'vim'
cask 'emacs-mac'
cask 'intellij-idea-ce'
cask 'visual-studio-code'

# Browsers
cask 'google-chrome'
cask 'firefox'

# Virt
cask 'vagrant'
cask 'virtualbox'
brew 'docker'

# Comm
brew 'keybase'
cask 'slack'
cask 'whatsapp'

# Sec
cask '1password'
cask 'gpgtools'
brew 'openssl'

# Video
cask 'vlc'
cask 'handbrake'
cask 'airflow'

# Util
cask 'alfred'
cask 'disk-inventory-x'
cask 'transmission'
cask 'itsycal'
cask 'bettersnaptool'
cask 'bettertouchtool'
cask 'calibre'
cask 'qbserve'
cask 'ukelele'
cask 'the-unarchiver'
cask 'mactex'
brew 'pandoc'
